[
  {
    "title": "Tatooine",
    "type": "Planet",
    "img": "https://upload.wikimedia.org/wikipedia/en/6/6d/Tatooine_%28fictional_desert_planet%29.jpg",
    "desc": "A harsh desert planet orbiting twin suns in the Outer Rim, Tatooine is sparsely inhabited and often described as a lawless, frontier-style world — home to moisture farms, smugglers, and outlaws. Historically, it has served as home to key figures such as Anakin Skywalker and Luke Skywalker. "
  },
  {
    "title": "Sith Holocron",
    "type": "Artifact",
    "img": "https://lumiere-a.akamaihd.net/v1/images/sith-holocron_fa76c67c.jpeg?region=0%2C0%2C1560%2C878",
    "desc": "A dark-side holocron, used by Sith practitioners to store forbidden teachings, ancient knowledge and dangerous secrets. Sith holocrons often demand a strong affinity with the dark side to unlock. These artifacts have roots stretching back millennia before the Sith–Jedi conflicts that shaped galactic history.  "
  },
  {
    "title": "Jedi Holocron",
    "type": "Artifact",
    "img": "https://cdnb.artstation.com/p/assets/images/images/028/229/113/large/sean-marino-holocron-02.jpg?1593850007",
    "desc": "A holocron created by the Jedi, used to store massive repositories of knowledge — from Force lore to historical records, philosophy, and Jedi teachings. Accessing a Jedi holocron typically requires a Force-sensitive individual and often serves as a way to pass on lore across generations of Jedi."
  },
  {
    "title": "Alderaan",
    "type": "Planet",
    "img": "https://lumiere-a.akamaihd.net/v1/images/alderaan-main_f5b676cf.jpeg?region=0%2C40%2C1280%2C640",
    "desc": "An Earth-like planet celebrated for its natural beauty, culture, and commitment to peace and diplomacy. Alderaan was regarded as one of the Republic’s most prestigious and idealistic worlds. Its destruction by the superweapon of the Empire became a defining tragedy — a grim illustration of tyranny’s price. "
  },
  {
    "title": "Galactic Empire",
    "type": "Faction",
    "img": "https://static.wikia.nocookie.net/empireatwar/images/c/ca/Imperial_Emblem_by_ConradChaos.png/revision/latest?cb=20150125062618",
    "desc": "An autocratic galactic regime formed after the fall of the Republic, the Empire centralized power under the Emperor and imposed martial law across star systems. It wielded overwhelming military and industrial might to suppress dissent — often ruling through fear, intimidation, and massive weapons of war. "
  },
  {
    "title": "Rebel Alliance",
    "type": "Faction",
    "img": "https://static.wikia.nocookie.net/star-wars-canon-extended/images/d/d3/Rebellion.jpg/revision/latest?cb=20171107224449",
    "desc": "A coalition of rebel dissidents, former loyalists, and freedom fighters who rose up against the Empire’s tyranny. The Rebel Alliance began with covert operations and eventually coordinated large-scale resistance, famously stealing the plans of the Empire’s ultimate weapon and striking the first blows in a galaxy-wide civil war. "
  },
  {
    "title": "Death Star",
    "type": "Superweapon",
    "img": "https://upload.wikimedia.org/wikipedia/en/f/f9/Death_star1.png",
    "desc": "A moon-sized battle station constructed by the Empire, armed with a planet-destroying superlaser powered by kyber crystals. The Death Star’s destructive capacity was unmatched — capable of annihilating entire planets with a single blast. Its use to destroy Alderaan shocked the galaxy and triggered widespread revolt against the Empire. Eventually, the Death Star was itself destroyed by the Rebel Alliance using stolen schematics that revealed a critical vulnerability. "
  }
]
